Repository: Patricia370/Health-Bits-Project
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: es

source: (Continued on next page)
es: (Continúa en la siguiente página)

source: 4 • Issue 9
es: 4 • Número 9

source: A repetitive strain injury (RSI) is an injury or disorder of the joints, nerves, muscles, ligaments or tendons.
es: Una lesión oseomuscular (LOM) es una lesión o trastorno de las articulaciones, nervios, músculos, ligamentos o tendones.

source: Carpal tunnel syndrome (CTS) is inflammation of the nerve that connects the forearm to the palm of the hand.
es: El síndrome del túnel carpiano es la inflamación del nervio que conecta el antebrazo con la palma de la mano.

source: Common symptoms linked to tendonitis of the wrist include extreme pain that extends from the forearm to the hand, along with a tingling feeling in the fingers.
es: Los síntomas más habituales asociados a la tendinitis de la muñeca incluyen un dolor intenso que se extiende desde el antebrazo hasta la mano y hormigueo en los dedos.

source: Computer users should be proactive and minimize their chance of health complications.
es: Los usuarios de ordenadores deberían ser proactivos y minimizar sus riesgos de sufrir complicaciones de salud.

source: Computer-related RSIs include tendonitis and carpal tunnel syndrome.
es: Entre las LOM relacionadas con el uso del ordenador están la tendinitis y el síndrome del tunel carpiano.

source: Health Concerns Related to Computer Use
es: Problemas de salud relacionados con el uso del ordenador

source: Monthly Newsletter
es: Boletín mensual

source: OSHA (Occupational Safety and Health Administration) has guidelines designed to minimize or prevent workplace injuries with respect to computer usage.
es: La ASSL (Administración para la salud y la seguridad laboral) ofrece algunos consejos destinados a minimizar o prevenir las lesiones relacionadas con el uso del ordenador en los lugares de trabajo.

source: RSIs are the largest job related injury and illness problem in the U.S.
es: Las LOM son el principal tipo de lesión o dolencia relacionada con el trabajo en los EEUU.

source: RSIs are the largest job-related injury and illness problem in the U.S.
es: Las LOM son el principal tipo de lesión o dolencia relacionada con el trabajo en los EEUU..

source: Repeated and/or forceful bending of the wrist can cause tendonitis or CTS.
es: El movimiento repetido o forzado de la muñeca puede provocar tendinitis o STC.

source: Some symptoms of CTS include numbness and tingling in the thumb and first two fingers, and a burning pain when the nerve is compressed.
es: Posibles síntomas de STC son falta de sensibilidad u hormigueo en el pulgar y los dor primeros dedos, y un dolor intenso cuando se presiona el nervio.

source: Tendonitis is inflammation of a tendon due to repeated motion or stress on that tendon.
es: La tendinitis es la inflamación de un tendón debido a la presión o a un movimiento repetido sobre él.

source: This article discusses computer health risks and preventions.
es: Este artículo habla sobre los riesgos para la salud que puede causar el ordeandor y cómo prevenirlos.

source: he widespread use of computers has been causing health concerns.
es: l uso generalizado de ordenadores ha generado preocupaciones sobre la salud..

source: today.
es: hoy en día.
